/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：编写一个函数copystr(p,q)，将p所指向的字符串的所有在奇数位置上的字符
      复制到q所指向的字符串中。如：原字符串为“abcd”，得到的字符串为“ac”
要求：p,q为指针参数，在主函数中实现字符串的输入与输出。
-------------------------------------------------------*/
#include <stdio.h>
void main()
{
        void copystr(char *p, char *q);
        char str1[20],str2[20];
        printf("请输入1个字符串:");
        gets(str1);
        copystr(str1,str2);
        printf("奇数位置上的字符串为:");
        puts(str2);
}
void copystr(char *p, char *q)
{
        int i,j=0;
       /**********Program**********/
	for( i=0 ; *(p+i)!=0 ; i++ )
		if( i%2==0 )
		{
			*(q+j) = *(p+i) ;
			j++ ;
		}
		*(q+j) = 0 ;
       /**********  End  **********/
}
